In [2]:
import pandas as pd

df = pd.read_csv("sunday_contacts.csv")
df

              id       first_name last_name             username  phone
0        1416148              t.d       NaN               EseTio    NaN
1        1618413  Swarley Stinson       NaN      Swarley_Stinson    NaN
2        3044266        Jose.....       NaN             Josebagv    NaN
3        3363169     Carmen Maria       NaN        Carmenmariagc    NaN
4        7768750         Montxino       NaN             montxino    NaN
...          ...              ...       ...                  ...    ...
2994  7441213699            Adele       NaN           hdhtdh1564    NaN
2995  7445289924    Văn Hoàng Anh    Nguyễn               nvha_2    NaN
2996  7455218256              295       NaN     khcbml_45phvfqel    NaN
2997  7474772926    driss lakciba       爱意.  rkxidng_70fldcturan    NaN
2998  7477890866          William    Cooper           WanictHeer    NaN

[2999 rows x 5 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          2999 non-null   int64
 1   first_name  2998 non-null   object
 2   last_name   1413 non-null   object
 3   username    2557 non-null   object
 4   phone       58 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 117.3+ KB

In [7]:
df.dropna(inplace= True)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 22 entries, 22 to 2840
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          22 non-null     int64
 1   first_name  22 non-null     object
 2   last_name   22 non-null     object
 3   username    22 non-null     object
 4   phone       22 non-null     float64
dtypes: float64(1), int64(1), object(3)
memory usage: 1.0+ KB

In [10]:
df.to_csv("new_contacts")